app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `user_username` = 'untung'
 LIMIT 1
---
    function login_process()
    {
        $users = new UsersModel();
        $username = $this->request->getVar('user_username');
        $pass = $this->request->getVar('user_pass');
        $user = $users->where(['user_username' => $username])->first();