app/Controllers/Users.php

SELECT *
FROM `users`
---
    public function index()
    {
        $data['menu']='master';
        $data['submenu']='users';

        $users= new UsersModel();
        $data['users'] = $users->findAll();